from main import List
import random

ll=List()
arr=[12,56,78,456,45,8,33]
for num in arr: 
  #Додавання елементів в кінець списку
  ll.PushBack(num)
#Виведення списку
print("Виведення списку:",ll.to_list())
#Виведення розміру списку
print("Розмір списку:",ll.Get_Count())
print("-------")

print("Додавання елементу '88' на початок списку:")
ll.PushFront(88)
print("Виведення списку:",ll.to_list())
print("-------")

print("Додавання елементу '99' на місце №3, рахуючи з 0 (Додавання елемента після вказаного вузла):")
ll.AddBefore(3,99)
print("Виведення списку:",ll.to_list())
print("-------")

print("Видалення першого елемента списку '88':")
ll.RemoveFirst()
print("Виведення списку:",ll.to_list())
print("-------")

print("Видалення останнього елемента списку '33':")
ll.RemoveLast()
print("Виведення списку:",ll.to_list())
print("-------")

print("Видалення довільного елемента списку '78':")
ll.RemoveNode(78)
print("Виведення списку:",ll.to_list())
print("-------")

print("Пошук за заданим ключем:")
#якщо елемент є в списку
print("Якщо елемент є в списку:",ll.find_key(56))
#якщо елемента немає в списку
print("Якщо елемента немає в списку:",ll.find_key(100))
print("-------")

#Завдання №1 з варіанту №3:
print("Завдання №1 з варіанту №3:")
print("Умова- Створити лінійний двозвʼязний список з цілих чисел. Вставити в список останній парний елемент після кожного непарного елемента:")
ll.task_1()
print("Виведення списку:",ll.to_list())

print("-----------------------------------")
ll2=List()
for i in range(10):
  ll2.PushBack(random.randint(1,25))
print("Створення нового списку рандомними значеннями:\nВиведення списку:",ll2.to_list())
print("Завдання №2 з варіанту №3:")
print("Умова- Створити лінійний двозвʼязний список з дійсних чисел. Визначити суму елементів списку зі значеннями більше або рівними 15:")
print("Виведення результату:",ll2.task_2())
print("-----------------------------------")

ll3=List()
for i in range(1,6):
  ll3.PushBack(i)
print("Виведення списку:",ll3.to_list())
print("Перевірка елементів на двозв'язковий список:\n")
ll3.check()